read -sv {input_verilog_file}
hierarchy -check -auto-top

proc; fsm; opt; memory; opt

# TODO: Change this to map to our cell library
techmap; opt

abc -liberty {input_liberty_file} -g AND

# Remove unused cells and wires
clean

# Generate schematics using graphviz
show -format dot -prefix {output_dot_file_name}

# Write design to BLIF file
write_blif {output_blif_file}
